/*
	@首页
	@数据交换共享分析-data
*/
var data = {
    //左侧数据项
    left: {
        //四库总量122543360
        SKZL: parseFloat(24985056/10000).toFixed(1),//万//归集数据总量

        //各委办局提交量
        GWBJTJL: parseFloat(24985056/10000).toFixed(1),

        //各委办局使用量
        GWBJSYL: parseFloat(17163535/10000).toFixed(1),//已支撑数据总量

        //人口信息
        RKXX: 17083253,

        //宏观经济信息
        HGJJXX: 624,

        //法人信息
        FRXX: 2268506,

        //空间地理
        KJDL: 1098812,
        
        //信用征信信息
        XYZXXX:920648,

        //备注说明
        notes: "常熟市信息资源中心对全市79家部门的604类政务资源信息进行了梳理、归集、处理及共享。共梳理、归集各类政务信息约2498万条，政务数据资源采集率达到83%，覆盖全市112万常住人口信息、2.5万企业信息、4.6万个体工商户信息，采集宏观经济指标52项。基本实现政府部门业务数据资源共享，数据资源整合和政府数据开放共享取得积极进展。已向全市各类业务系统提供了382类1716万条数据，实现了数据的合理流动和综合应用，为政务数据共享，大数据产业发展奠定坚实基础。"
    },

    //右侧数据项
    right: {
        //数据使用率
        SJSYL: 83,

        //叠加柱状图
        stackBar: {
            legend_data: ['已提交', '未提交','\n','社会公开','政府内部条件共享','政府内部不共享'],//, '可共享', '不可共享'

            xAxis_data: ['法人', '人口', '空间地理', '宏观经济', '信用征信'],

            series_data: [
                { name: "已提交", stack: "提交", color: "#d13e44", data: [228,117,198,6,63] },
                { name: "未提交", stack: "提交", color: "#ffce19", data: [71, 46, 0, 0, 6] },
                { name: "社会公开", stack: "共享", color: "#26beff", data: [180,58,130,6,50] },
                { name: "政府内部条件共享", stack: "共享", color: "#8be27d", data: [47,57,68,0,13] },
                { name: "政府内部不共享", stack: "共享", color: "#8be27d", data: [1,2,0,0,0] }
            ],
            //已梳理目录
            YSLML: 735,
            //已归集目录
            YGJML: 612
        },

        // //四库共享情况
        // SKGXQK: {
        //     xAxis_data: ["人口库", "法人库", "宏观经济", "空间地理"],
        //     series_data_share: [134, 256, 49, 5],
        //     series_data_unshare: [26, 36, 4, 0]
        // },
        //四库提交情况
        SKTJQK: {
            xAxis_data: ["人口库", "法人库", "宏观经济", "空间地理","征信"],
            series_name1: "已提交",
            series_data1: [228, 117, 6, 42,63],
            series_name2: "未提交",
            series_data2: [71, 46, 0, 0, 6]
        }
    }
}