<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<script>


    function init_chd() {
        var myChart = echarts.init(document.getElementById('container'));
        var geoJson={"type":"FeatureCollection","features":[{"type":"Feature","properties":{"name":"大理市"},"geometry":{"type":"MultiPolygon","coordinates":[[[[100.183260527344,26.0697585273438],[100.216929960938,26.0197585273438],[100.283260527344,26.0279274726562],[100.313973417969,26.0479274726563],[100.332869902344,26.0313063789063],[100.347345,25.973843],[100.3119153125,25.9591921210938],[100.31408328125,25.9321950507813],[100.300484648438,25.8951638007813],[100.275738554688,25.8738430000001],[100.29271609375,25.85921409375],[100.30197390625,25.8484719062501],[100.320931425781,25.8321364570313],[100.29197390625,25.81921409375],[100.28271609375,25.7664455390625],[100.310111113281,25.7428444648438],[100.34197390625,25.6984719062501],[100.369632597656,25.6861305976562],[100.382977324219,25.6562209296875],[100.408089628906,25.6345876289063],[100.437345,25.583843],[100.419222441406,25.5801833320313],[100.434801054688,25.548843],[100.427345,25.533843],[100.40197390625,25.48921409375],[100.383956328125,25.4293752265625],[100.355697050781,25.4271047187501],[100.337345,25.433843],[100.34318484375,25.4490358710937],[100.302916289063,25.499389875],[100.27365359375,25.5117189765625],[100.262899199219,25.4982888007813],[100.246922636719,25.4893971992188],[100.211890898438,25.533139875],[100.162345,25.526977765625],[100.142345,25.5294655585938],[100.127345,25.5276003242188],[100.112345,25.5294655585938],[100.087061796875,25.5263210273437],[100.092967558594,25.478843],[100.090982695313,25.4628884101563],[100.062899199219,25.4793971992188],[100.02861453125,25.4938430000001],[100.033031035156,25.5293581367188],[100.017345,25.533843],[100.02170046875,25.5494875312501],[100.045985136719,25.5822389960938],[100.108736601563,25.5575710273438],[100.128421660156,25.5604787421876],[100.111312285156,25.588843],[100.130069609375,25.61993675],[100.094605742188,25.6677712226563],[100.08298953125,25.7094875312501],[100.05170046875,25.74819846875],[100.04298953125,25.76948753125],[100.02170046875,25.79819846875],[100.007823515625,25.8480373359375],[99.9817004687501,25.86819846875],[99.9773450000001,25.8738430000001],[99.9991150195313,25.8794289375001],[100.003465605469,25.898843],[100.000186796875,25.9134743476563],[100.013016386719,25.932055890625],[100.041673613281,25.925630109375],[100.057254667969,25.9481960273438],[100.104158964844,25.9657472968751],[100.098460722656,25.9911647773438],[100.145706816406,26.008843],[100.141087675781,26.0294557929688],[100.151429472656,26.0697585273438],[100.177345,26.073843],[100.183260527344,26.0697585273438]]]]}}]};;
        echarts.registerMap('jingmen', geoJson);
        var option = {
            title: {
                text: '产业重合度',
                subtext: '全部行业',
                x:'left'
            },
            tooltip: {
                trigger: 'item',
                formatter: '{b}<br/>{c}'
            },
            visualMap: {
                min: 0,
                max: 1,
                text:['高','低'],
                x: 'right',
                y: 'bottom',
                realtime: false,
                calculable: true,
                color: ['#336666','#D1E9E9']
            },
            series: [
                {
                    name: '重合度',
                    type: 'map',
                    mapType: 'jingmen', // 自定义扩展图表类型
                    itemStyle:{
                        normal:{label:{show:true}},
                        emphasis:{label:{show:true}}
                    },
                    data: [
                        {name: '大理市', value:1},
                   ]

                }

            ]
        }
        myChart.setOption(option);
    }


    function showYear() {
        var option = '';
        for (var i = year - 1; i >= 2006; i--) {
            option += "<option value='" + i + "'>" + i + "</option>";
        }
        $("#year").html(option);
    }

    $(function () {
        showYear();
        initTable();
        init_chd();
//        $('#year').change(function () {
//            init_rk('container', '320000000000', $(this).val());
//        });
        $("#myTab li").removeClass("active");
        $("#myTab li").eq(0).addClass("active");
    });
    function initTable(){
        var dataList = $("#dataList tbody");
        dataList.html("");
        var list =  [{'hy':'全部行业','chd':'0.87','qs':'缩减'},
            {'hy':'农、林、牧、渔业','chd':'0.8','qs':'扩大'},

            {'hy':'制造业','chd':'0.37','qs':'缩减'},
            {'hy':'文化及其相关产业','chd':'0.7','qs':'扩大'},
            {'hy':'租赁和商务服务业','chd':'0.6','qs':'扩大'},
            {'hy':'食品加工业','chd':'0.27','qs':'缩减'},
            {'hy':'轻工业','chd':'0.81','qs':'扩大'},
            {'hy':'原材料加工业','chd':'0.77','qs':'扩大'},
            {'hy':'装备制造业','chd':'0.17','qs':'缩减'},

            {'hy':'交通运输业','chd':'0.37','qs':'缩减'},
            {'hy':'生产性服务业','chd':'0.7','qs':'扩大'},
            {'hy':'现代服务业','chd':'0.6','qs':'扩大'},


            {'hy':'批发和零售业','chd':'0.57','qs':'缩减'}];
        for(var i=0;i < list.length;i++){
            var temp = list[i];
            var html = "";
            html = html + "<tr>";
            html = html + "<td>"+temp.hy+"</td>";
            html = html + "<td>"+temp.chd+"</td>";
            html = html + "<td>"+temp.qs+"</td>";
            html = html + "</tr>";
            dataList.append($(html));
        }
    }
</script>
<div class="tab-content nbn_a" >

    <div class="tab-pane active" id="home">
        <div class="w">
            <select id="year" class="ml10 mt10"></select>
            <select id="industry" class="ml10 mt10">
                <option value="">全部行业</option>
                <option value="制造业">制造业</option>
                <option value="农业">农业</option>
                <option value="轻工业">轻工业</option>
            </select>
        </div>
        <div id="container" style="width:63%;height: 450px;float: left" ></div>

        <div id="zbpm" class="zbpm" style="float: right;width: 35%;">

            <table id="dataList" class="table-bordered table table-condensed" style="float: left;width: 90%">
                <thead>
                    <tr><th>行业</th><th>平均重合度</th><th>趋势</th></tr>
                </thead>
                <tbody></tbody>
            </table>

        </div>

        <p class="qc"></p>
    </div>
    <!--右悬浮-->
    <div class="right-fix">
        <div class="right-fix-list">
            <div class="right-fix-ico">
                <img src="/${res}/img/righ.jpg">
            </div>
            <ul class="fix-tab">
                <li class="active">指示解释</li>
                <li>统计范围</li>
                <li>调查方法</li>
                <li>建立数据</li>
                <li>发布时间</li>
            </ul>
            <ul class="fix-intro">
			<li style="display: block;">
                    <p>测试数据
                    </p>
                </li>
                <li>
                    <p>
                    </p>
                </li>
                <li>
                    <p></p>
                </li>
                <li>
                    <p></p>
                </li>
                <li>
                    <p></p>
                </li>
                <%--<li style="display: block;">
                    <p>    常住人口指经常居住在某一地区的人口。目前在我国，常住人口是指实际经常居住在某地区半年以上的人口。以乡（镇、街道）为例，一个乡（镇、街道）的常住人口具体包括：①居住在本乡（镇、街道），并已在本乡（镇、街道）办理常住户口登记的人；②户口在本乡（镇、街道），外出不满半年的人；③已在本乡（镇、街道）居住半年以上，常住户口在本乡（镇、街道）以外的人；④在本乡（镇、街道）居住不满半年，但已离开常住户口地半年以上的人；⑤居住在本乡（镇、街道），常住户口待定的人；⑥原住本乡（镇、街道），目前在国外工作或者学习，暂无所在国永久居住权的人。
                    </p>
                </li>
                <li>
                    <p>      全部常住本地的户籍人口，除离开本地半年以上（不包括在国外工作或学习的人）的；户口在外地，但在本地居住半年以上者，或离开户口地半年以上而调查时在本地居住的人口；调查时居住在本地，但在任何地方都没有登记常住户口，如手持户口迁移证、出生证、退伍证、劳改劳教释放证等尚未办理常住户口的人，即所谓“口袋户口”的人。
                    </p>
                </li>
                <li>
                    <p>人口普查、非普查年份的全国1%人口抽样调查和全国人口变动情况抽样调查，推算总人口和其他人口指标数据。</p>
                </li>
                <li>
                    <p></p>
                </li>
                <li>
                    <p>一般于次年1月底2月初发布。</p>
                </li>--%>
            </ul>
        </div>
    </div>

</div>
