/*
	@首页
	@数据交换共享分析-data
*/
var data = {
    //左侧数据项
    left: {
        //四库总量122543360
        SKZL: parseFloat(122543360/10000).toFixed(1),//万

        //各委办局提交量
        GWBJTJL: parseFloat(122543360/10000).toFixed(1),

        //各委办局使用量
        GWBJSYL: parseFloat(62110233/10000).toFixed(1),

        //人口信息
        RKXX: 89469941,

        //宏观经济信息
        HGJJXX: 31518,

        //法人信息
        FRXX: 33040423,

        //空间地理
        KJDL: 1478,

        //备注说明
        notes: "徐州市信息资源枢纽工程对全市78家部门的528类政务资源信息进行了梳理、归集 、处理及共享。共梳理、归集各类政务信息约1.22亿条，政务数据资源采集率达到86%，覆盖全市1027万常住人口信息、18.5万企业 信息、38.1万个体工商户信息，采集宏观经济指标500多项。基本实现政府部门业务数据资源共享，数据资源整合和政府数据开放共享取得积极进展。已向全市各类业务系统提供了57类7317万条数据，实现了数据的合理流动和综合应用，为政务数据共享，大数据产业发展奠定坚实基础。"
    },

    //右侧数据项
    right: {
        //数据使用率
        SJSYL: 86,

        //叠加柱状图
        stackBar: {
            legend_data: ['已提交', '未提交', '可共享', '不可共享'],

            xAxis_data: ['空间地理', '宏观经济', '法人', '人口'],

            series_data: [
                { name: "已提交", stack: "提交", color: "#d13e44", data: [18, 35, 222, 123] },
                { name: "未提交", stack: "提交", color: "#ffce19", data: [5, 14, 34, 11] },
                { name: "可共享", stack: "共享", color: "#26beff", data: [23, 49, 256, 134] },
                { name: "不可共享", stack: "共享", color: "#8be27d", data: [0, 4, 36, 26] }
            ],
            //已梳理目录
            YSLML: 528,
            //已归集目录
            YGJML: 398
        },

        //四库共享情况
        SKGXQK: {
            xAxis_data: ["人口库", "法人库", "宏观经济", "空间地理"],
            series_data_share: [134, 256, 49, 5],
            series_data_unshare: [26, 36, 4, 0]
        },
        //四库提交情况
        SKTJQK: {
            xAxis_data: ["人口库", "法人库", "宏观经济", "空间地理"],
            series_name1: "已提交",
            series_data1: [123, 222, 35, 18],
            series_name2: "未提交",
            series_data2: [11, 34, 14, 5]
        }
    }
}